app/controllers/api/answers_controller.rb

  def index
    render json: Answer.all
---
SELECT "answers".* FROM "answers"