app/controllers/api/answers_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    render json: Card.all

INSERT INTO "answers" ("a", "b", "c", "d", "correct", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    answer = Answer.new(answer_params)

    if answer.save