app/controllers/api/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    render json: Card.all

INSERT INTO "cards" ("name", "points", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "2312312"], ["points", 100], ["category_id", 12], ["created_at", "2020-03-30 02:43:40.416237"], ["updated_at", "2020-03-30 02:43:40.416237"]]
---
  def create
    card = Card.new(card_params)
    if card.save