app/controllers/api/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    render json: Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Testing"], ["created_at", "2020-03-28 04:50:38.881809"], ["updated_at", "2020-03-28 04:50:38.881809"]]
---
  def create
    category = Category.new(category_params)

    if category.save